Project/Toir.Adaptation/src/Catalogs/гкс_ПроизвольныеНастройкиИнтеграций/гкс_ПроизвольныеНастройкиИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f7954be1-86f2-4e13-9837-d2a42dc4d403">
  <name>гкс_ПроизвольныеНастройкиИнтеграций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9f8eb78e-1cbe-41e9-9240-35ef4ace121a">
    <name>ДопСвойства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="05eaf328-d5be-4e7b-90f6-0c245f5888bc">
    <name>Свойства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4057ede0-2c77-4630-ba90-13eae2cb911b">
      <name>Ключ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7dbc80a5-8863-4cec-b3b3-b3c76d03b314">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Catalogs/гкс_ПроизвольныеНастройкиИнтеграций/ManagerModule.bsl
&ИзменениеИКонтроль("Свойства")
Функция гкс_Свойства(СсылкаНаНастройку)
	
	#Вставка
	// Гкс+[TOIR20-381] Лебедев Н.А. от 03.07.2023. Добавлено:{
	УстановитьПривилегированныйРежим(Истина);
	// Гкс-[TOIR20-381] Лебедев Н.А. от 03.07.2023. 
	#КонецВставки
	Свойства = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолучитьСвойства();
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаНастройку); 

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Свойства.Вставить(Выборка.Ключ, Выборка.Значение); 
	КонецЦикла;

	Возврат Свойства;

КонецФункции
